In [1]:
import pandas as pd 
import numpy as np 
import matplotlib.pyplot as plt

In [2]:
data = pd.read_csv("ApartmentRentPrediction.csv")

In [3]:
df = data.copy()

In [4]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9000 entries, 0 to 8999
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             9000 non-null   int64
 1   category       9000 non-null   object
 2   title          9000 non-null   object
 3   body           9000 non-null   object
 4   amenities      5815 non-null   object
 5   bathrooms      8970 non-null   float64
 6   bedrooms       8993 non-null   float64
 7   currency       9000 non-null   object
 8   fee            9000 non-null   object
 9   has_photo      9000 non-null   object
 10  pets_allowed   5249 non-null   object
 11  price          9000 non-null   int64
 12  price_display  9000 non-null   object
 13  price_type     9000 non-null   object
 14  square_feet    9000 non-null   int64
 15  address        6029 non-null   object
 16  cityname       8934 non-null   object
 17  state          8934 non-null   object
 18  latitude       8993 non-null   float64
 19  longitude      8993 non-null   float64
 20  source         9000 non-null   object
 21  time           9000 non-null   int64
dtypes: float64(4), int64(4), object(14)
memory usage: 1.5+ MB

In [5]:
#columns with  more than 5000 distinct values should be removed or preprocessed to include less range 
for i  in data.columns:
    print(i)
    print( data[i].value_counts().shape)

id
(9000,)
category
(3,)
title
(8441,)
body
(8969,)
amenities
(2093,)
bathrooms
(14,)
bedrooms
(10,)
currency
(1,)
fee
(1,)
has_photo
(3,)
pets_allowed
(3,)
price
(1646,)
price_display
(1647,)
price_type
(3,)
square_feet
(1682,)
address
(6016,)
cityname
(1497,)
state
(50,)
latitude
(2257,)
longitude
(2254,)
source
(11,)
time
(5886,)

In [6]:
data.describe()

,id,bathrooms,bedrooms,price,square_feet,latitude,longitude,time
count,9.000000e+03,8970.000000,8993.000000,9000.000000,9000.000000,8993.00000,8993.000000,9.000000e+03
mean,5.623668e+09,1.380769,1.744023,1487.286222,947.138667,37.67689,-94.778612,1.574906e+09
std,7.007402e+07,0.616171,0.942446,1088.561190,668.806214,5.51527,15.769232,3.755142e+06
min,5.508654e+09,1.000000,0.000000,200.000000,106.000000,21.31550,-158.022100,1.568744e+09
25%,5.509250e+09,1.000000,1.000000,950.000000,650.000000,33.66200,-101.858700,1.568781e+09
50%,5.668610e+09,1.000000,2.000000,1275.000000,802.000000,38.75550,-93.707700,1.577358e+09
75%,5.668626e+09,2.000000,2.000000,1695.000000,1100.000000,41.34980,-82.446800,1.577359e+09
max,5.668663e+09,8.500000,9.000000,52500.000000,40000.000000,61.59400,-70.191600,1.577362e+09

In [7]:
data.head(5)

,id,category,title,body,amenities,bathrooms,bedrooms,currency,fee,has_photo,...,price_display,price_type,square_feet,address,cityname,state,latitude,longitude,source,time
0,5508832632,housing/rent/apartment,"Two BR - $1,194/mo - Apartment - come and see ...","Come experience. in Cary, NC offering recently...","Clubhouse,Fireplace,Gym,Patio/Deck,Playground,...",2.5,2.0,USD,No,Thumbnail,...,"$1,194",Monthly,800,NaN,Cary,NC,35.7585,-78.7783,RentDigs.com,1568755960
1,5664576849,housing/rent/apartment,One BR 640 West Wilson Street,This unit is located at 640 West Wilson Street...,"Cable or Satellite,Dishwasher,Elevator,Garbage...",1.0,1.0,USD,No,Thumbnail,...,"$1,370",Monthly,795,640 West Wilson St,Madison,WI,43.0724,-89.4003,RentLingo,1577015508
2,5668619365,housing/rent/apartment,One BR 2777 Sw Archer Rd,"This unit is located at 2777 Sw Archer Rd, Gai...","Basketball,Cable or Satellite,Dishwasher,Inter...",1.0,1.0,USD,No,Thumbnail,...,"$1,009",Monthly,560,2777 SW Archer Road,Gainesville,FL,29.6533,-82.3656,RentLingo,1577358921
3,5668632604,housing/rent/apartment,One BR 534-542 Park Avenue,"This unit is located at 534-542 Park Avenue, O...",NaN,1.0,1.0,USD,No,Thumbnail,...,$695,Monthly,600,534-542 Park Ave,Omaha,NE,41.2562,-96.0404,RentLingo,1577359849
4,5668637441,housing/rent/apartment,Three BR 2216 S Palm Grove Ave,"This unit is located at 2216 S Palm Grove Ave,...",NaN,3.0,3.0,USD,No,Thumbnail,...,"$3,695",Monthly,1600,2216 S Palm Grove Avenue,Los Angeles,CA,34.0372,-118.2972,RentLingo,1577360159

In [8]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9000 entries, 0 to 8999
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             9000 non-null   int64
 1   category       9000 non-null   object
 2   title          9000 non-null   object
 3   body           9000 non-null   object
 4   amenities      5815 non-null   object
 5   bathrooms      8970 non-null   float64
 6   bedrooms       8993 non-null   float64
 7   currency       9000 non-null   object
 8   fee            9000 non-null   object
 9   has_photo      9000 non-null   object
 10  pets_allowed   5249 non-null   object
 11  price          9000 non-null   int64
 12  price_display  9000 non-null   object
 13  price_type     9000 non-null   object
 14  square_feet    9000 non-null   int64
 15  address        6029 non-null   object
 16  cityname       8934 non-null   object
 17  state          8934 non-null   object
 18  latitude       8993 non-null   float64
 19  longitude      8993 non-null   float64
 20  source         9000 non-null   object
 21  time           9000 non-null   int64
dtypes: float64(4), int64(4), object(14)
memory usage: 1.5+ MB

## Null values

In [9]:
df.isna().sum()

id                  0
category            0
title               0
body                0
amenities        3185
bathrooms          30
bedrooms            7
currency            0
fee                 0
has_photo           0
pets_allowed     3751
price               0
price_display       0
price_type          0
square_feet         0
address          2971
cityname           66
state              66
latitude            7
longitude           7
source              0
time                0
dtype: int64

In [10]:
object_columns_na = ("amenities","pets_allowed","address","cityname","state")

In [11]:
for i in object_columns_na:
    print("=================================")
    print(i)
    print(df[i].value_counts())

=================================
amenities
Parking                                                                                                         212
Dishwasher,Refrigerator                                                                                         200
Pool                                                                                                            148
Dishwasher,Parking,Pool                                                                                         134
Dishwasher                                                                                                      133
                                                                                                               ...
Dishwasher,Garbage Disposal,Gated,Hot Tub,Parking,Patio/Deck,Pool,Refrigerator,Storage                            1
Cable or Satellite,Dishwasher,Fireplace,Internet Access,Parking,Patio/Deck,Pool,Refrigerator,Storage              1
AC,Basketball,Cable or Satellite,Dishwasher,Gym,Parking,Patio/Deck,Playground,Pool,Refrigerator,Washer Dryer      1
AC,Basketball,Cable or Satellite,Clubhouse,Elevator,Fireplace,Gated,Gym,Parking,Pool,Storage,Washer Dryer         1
Dishwasher,Fireplace,Parking,Pool,Refrigerator,Storage                                                            1
Name: amenities, Length: 2093, dtype: int64
=================================
pets_allowed
Cats,Dogs    4702
Cats          433
Dogs          114
Name: pets_allowed, dtype: int64
=================================
address
500 Sleepy Hollow Rd           3
908 8th SW St                  3
7098 Fernwood St               2
2571 Lake Worth Road           2
#4 Pahrump Valley Boulevard    2
                              ..
8 South 8th St                 1
277-279 Columbus Ave           1
9860 Fairfax Square            1
5700 S Blackstone Avenue       1
5505 Zelzah Ave                1
Name: address, Length: 6016, dtype: int64
=================================
cityname
Austin         482
Dallas         194
Houston        173
San Antonio    169
Los Angeles    151
              ...
Santa Ana        1
Coppell          1
Fernley          1
Chubbuck         1
Camas            1
Name: cityname, Length: 1497, dtype: int64
=================================
state
TX    1588
CA     863
WA     471
NC     400
MD     373
NJ     341
GA     332
FL     297
CO     292
OH     284
WI     264
IL     262
IN     216
MO     215
MN     201
OR     184
VA     182
IA     163
MI     162
PA     161
OK     154
MA     138
AZ     115
NV     108
ND      97
CT      89
NE      89
TN      86
KS      76
UT      74
DC      71
SC      71
NY      63
NH      61
LA      61
SD      59
AR      54
AL      52
AK      42
KY      40
ID      16
VT      14
HI      11
RI      10
NM       9
MS       7
MT       7
DE       5
WV       3
WY       1
Name: state, dtype: int64

In [12]:
#unknown city can be predicted from state but now for simplicity will be replaced with mode 

from statistics import mode
df["amenities"].fillna("Parking", inplace=True)
df["pets_allowed"].fillna(mode(df["pets_allowed"]), inplace=True)
df["cityname"].fillna(mode(df["cityname"]), inplace=True)
df["state"].fillna(mode(df["state"]), inplace=True)

In [13]:
import re
def extract_road_name(address):
    
    pattern = r'\d*\s+([\w\s]+)\s+\w+$'
    match = re.search(pattern, address)
    
    if match:
        road_name = match.group(1)
        return road_name
    else:
        
        return None

In [14]:
df["address"] = df["address"].apply(lambda x: extract_road_name(x) if pd.notnull(x) else x)

In [15]:
df["address"].fillna(method='ffill', inplace=True)

In [16]:
df["address"].value_counts()

E                 89
W                 69
S                 53
N                 52
West              40
                  ..
N Blair            1
Briarthorne        1
River Crossing     1
Wickslow           1
Zelzah             1
Name: address, Length: 4304, dtype: int64

In [17]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9000 entries, 0 to 8999
Data columns (total 22 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             9000 non-null   int64
 1   category       9000 non-null   object
 2   title          9000 non-null   object
 3   body           9000 non-null   object
 4   amenities      9000 non-null   object
 5   bathrooms      8970 non-null   float64
 6   bedrooms       8993 non-null   float64
 7   currency       9000 non-null   object
 8   fee            9000 non-null   object
 9   has_photo      9000 non-null   object
 10  pets_allowed   9000 non-null   object
 11  price          9000 non-null   int64
 12  price_display  9000 non-null   object
 13  price_type     9000 non-null   object
 14  square_feet    9000 non-null   int64
 15  address        8999 non-null   object
 16  cityname       9000 non-null   object
 17  state          9000 non-null   object
 18  latitude       8993 non-null   float64
 19  longitude      8993 non-null   float64
 20  source         9000 non-null   object
 21  time           9000 non-null   int64
dtypes: float64(4), int64(4), object(14)
memory usage: 1.5+ MB

# tarek -> object columns preprocessing and plotting
# shehap - > int/float preprocessing and plotting